1. We need to run some reports on our firmâ€™s sales department to see how they are doing and are given the data in the following dictionaries:

In [1]:
import numpy as np
import pandas as pd

In [2]:
# create df 1 of sales by employees
sales = {'Tony': 103,
        'Sally': 202,
        'Randy': 380,
        'Ellen': 101,
        'Fred': 82}

In [3]:
# Dataframe of all employees and the region they work in
region = {'Tony': 'West',
          'Sally': 'South',
          'Carl': 'West',
          'Archie': 'North',
          'Randy': 'East',
          'Ellen': 'South',
          'Fred': np.nan,
          'Mo': 'East',
          'HanWei': np.nan,
         }

In [4]:
#create the dataframes from the list
sales_df = pd.DataFrame.from_dict(sales, orient = 'index', columns = ['sales'])
region_df = pd.DataFrame.from_dict(region, orient = 'index', columns = ['region'])

In [5]:
sales_df.head()

       sales
Tony     103
Sally    202
Randy    380
Ellen    101
Fred      82

In [6]:
region_df.head()

       region
Tony     West
Sally   South
Carl     West
Archie  North
Randy    East

In [7]:
#index function
sales_df.index

Index(['Tony', 'Sally', 'Randy', 'Ellen', 'Fred'], dtype='object')

In [8]:
#loc function
sales_df.loc['Randy']

sales    380
Name: Randy, dtype: int64

2. Using the join function

In [13]:
#join function
joined_df = region_df.join(sales_df, how = 'left')
print(joined_df)

       region  sales
Tony     West  103.0
Sally   South  202.0
Carl     West    NaN
Archie  North    NaN
Randy    East  380.0
Ellen   South  101.0
Fred      NaN   82.0
Mo       East    NaN
HanWei    NaN    NaN

3. Using merge function

In [14]:
joined_df_merge = region_df.merge(sales_df, how='left', 
                                      left_index=True,
                                      right_index=True)
print(joined_df_merge)

       region  sales
Tony     West  103.0
Sally   South  202.0
Carl     West    NaN
Archie  North    NaN
Randy    East  380.0
Ellen   South  101.0
Fred      NaN   82.0
Mo       East    NaN
HanWei    NaN    NaN

In [16]:
grouped_df = joined_df_merge.groupby(by='region').sum()
grouped_df.reset_index(inplace=True)
print(grouped_df)

  region  sales
0   East  380.0
1  North    0.0
2  South  303.0
3   West  103.0

In [17]:
companies = pd.read_csv('https://gist.githubusercontent.com/alexdebrie/90954a10bbdebd89185f7b4d340563cd/raw/d91744e599356b7a52b9c027751d4613c06c5f40/companies.csv')

In [18]:
print(companies)

  symbol  employees headquarters_city headquarters_state
0   AMZN     613300           Seattle                 WA
1   GOOG      98771     Mountain View                 CA
2   AAPL     132000         Cupertino                 CA